# AXMImportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AXMImportOptions Constructor
AXMImportOptions Class See Also
---
Constructs a new instance of AXMImportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public AXMImportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AXMImportOptions()
```

# See Also
AXMImportOptions Class
AXMImportOptions Overload
Autodesk.Revit.DB Namespace